<!-- 用户协议 -->

<template>
  <div class="page-agreement">
    <div class="content">
      <h1>好赛擂活动赛事系统用户协议</h1>

      <p class="abstract">
        <span class="darker">深圳好赛擂科技有限公司</span>
        （以下简称“好赛擂”）在此特别提醒您（用户，“用户”是指注册、登录、使用本服务的企业或者个人）在注册成为用户之前，请认真阅读本《用户协议》（以下简称“协议”）欢迎阅读好赛擂平台用户协议（下称“本协议”）。本协议阐述之条款和条件适用于您使用好赛擂平台所提供的各种工具和服务（下称“服务”）。
      </p>

      <div class="block">
        <h2>一、服务条款确认</h2>
        <p>
          好赛擂平台根据本服务条款及对该条款的修改向用户提供服务。本服务条款具有合同法上的法律效力。
        </p>
        <p>
          如果您对协议的任何条款表示异议，您可以选择不注册，一旦您点选“注册”并通过注册程序，即表示您自愿接受本协议之所有条款，您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。用户在使用好赛擂平台的同时，同意接受好赛擂平台会员服务提供的各类信息服务。
        </p>
      </div>

      <div class="block">
        <h2>二、服务内容及修改、中断、终止</h2>
        <p>
          1.&nbsp;
          好赛擂平台服务的具体内容由本平台根据实际情况提供，并对所提供之服务拥有最终解释权。
        </p>
        <p>
          2.&nbsp;
          好赛擂平台仅向其会员提供相关服务，与相关服务有关的设备（如个人电脑、手机、及其他与接入互联网或移动网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费）均由会员自行负担。
        </p>
        <p>
          3.&nbsp;
          好赛擂平台有权于任何时间暂时或永久修改或终止本服务（或其任何部分），而无论其通知与否，好赛擂平台对用户和任何第三人均无需承担任何责任。
        </p>
        <p>
          4.&nbsp;
          您同意好赛擂平台得基于其自行之考虑，因任何理由，包含但不限于长时间未使用，或好赛擂平台认为您已经违反本服务协议的文字及精神，终止您的密码、帐号或本服务之使用（或服务之任何部分），并将您在本服务内任何内容加以移除并删除。您同意依本服务协议任何规定提供之服务，无需进行事先通知即可中断或终止，您承认并同意，好赛擂平台可立即关闭或删除您的帐号及您帐号中所有相关信息及文件，或禁止继续使用前述文件或本服务。
        </p>
        <p>
          5.&nbsp;
          此外，您同意若本服务之使用被中断或终止或您的帐号及相关信息和文件被关闭或删除，好赛擂平台对您或任何第三人均不承担任何责任。
        </p>
      </div>

      <div class="block">
        <h2>三、会员帐号及密码</h2>
        <p>
          1.&nbsp;
          用户注册会员成功后，好赛擂平台将给予每个会员一个帐号及相应的密码，该帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。
        </p>
        <p>
          2.&nbsp;
          因黑客行为或会员保管疏忽致使帐号、密码被他人非法使用的，本公司不承担任何责任。如您发现任何非法使用会员帐号或安全漏洞的情况，请立即与本公司联系。
        </p>
      </div>

      <div class="block">
        <h2>四、注册信息和隐私保护</h2>
        <p>
          1.&nbsp;
          好赛擂平台帐号的所有权归好赛擂平台，用户完成注册申请手续后，获得好赛擂平台平台帐号的使用权。
        </p>
        <p>
          2.&nbsp;
          用户不得将其帐号、密码转让或出借予他人使用。如发现其帐号遭他人非法使用，应立即通知好赛擂平台。
        </p>
        <p>
          3.&nbsp; 好赛擂平台不对外公开或向第三方提供单个用户的注册资料，除非：
        </p>
        <ul>
          <li>事先获得用户的明确授权；</li>
          <li>根据有关的法律法规要求；</li>
          <li>按照相关政府主管部门的要求；</li>
          <li>为维护好赛擂平台的合法权益。</li>
        </ul>
        <p>
          4.&nbsp;
          在您注册好赛擂平台帐户，使用好赛擂平台产品或服务，或访问好赛擂平台网页时，好赛擂平台收集您的个人身份识别资料，并会将这些资料用于改进为您提供的服务及网页内容。
        </p>
      </div>

      <div class="block">
        <h2>五、用户权责</h2>
        <h3>用户义务</h3>
        <p>
          您知悉并承诺，在使用好赛擂平台所提供的服务的过程中，您应遵守相关法律法规，不应从事如下违反法律法规的规定，影响正常服务提供或损害他人合法利益的行为：
        </p>
        <p>
          1.&nbsp;
          不应利用好赛擂平台或相关服务危害国家安全、破坏政治稳定、泄露国家秘密，不侵犯国家、社会、集体利益和第三方的合法权益，不从事违法犯罪活动，不设立用于实施诈骗，传授犯罪方法，制作或者销售违禁物品、管制物品等违法犯罪活动的网站、通讯群组，不利用网络发布涉及实施诈骗，制作或者销售违禁物品、管制物品以及其他违法犯罪活动的信息；
        </p>
        <p>
          2.&nbsp;
          不应制作、发布、复制、查阅和传播、存储、链接下列信息：反对宪法所确定的基本原则的；危害国家安全，泄露国家秘密，颠覆国家政权，推翻社会主义制度，煽动分裂国家，破坏国家统一的；损害国家荣誉和利益的；煽动民族仇恨、民族歧视，破坏民族团结的；破坏国家宗教政策，宣扬邪教和封建迷信的；煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；捏造、散布谣言，侵犯他人权利，扰乱经济、社会秩序，破坏社会稳定的；散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；侮辱或者诽谤他人，侵害他人合法权益的；宣扬恐怖主义、极端主义的；违背当地风俗习惯的；含有法律、行政法规禁止的其他内容的；
        </p>
        <p>
          3.&nbsp;
          不应从事下列危害计算机信息网络安全的活动：对网络服务及相关软硬件设施进行破解、破坏、删除、修改或者增加的；对计算机信息网络中存储或者传输的数据和应用程序进行删除、修改或者增加的；使用软件或硬件等方式窃取他人口令、非法入侵他人计算机系统；故意制作、传播计算机病毒等破坏性程序的；其他危害计算机信息网络安全的活动；
        </p>
        <p>
          4.&nbsp;
          不应擅自复制和使用网络上未公开和未授权的文件。除相关著作权人明示同意，不应在网络中擅自破解、传播、下载或复制第三人享有著作权的软件或进行其他任何侵害他人知识产权的活动；
        </p>
        <p>
          5.&nbsp;
          不应因对好赛擂平台相关服务的使用行为导致好赛擂平台卷入政治和公共事件；
        </p>
        <p>
          6.&nbsp;
          不应发布不实或者虚假信息，欺骗或者诱导他人，给好赛擂平台或者他人造成损失。
        </p>

        <h3>责任承担</h3>
        <p>
          1.&nbsp;
          用户承诺给予获奖选手的奖励应如约如实兑现，若因违背活动赛制规则引起的法律纠纷及相关责任由用户自行承担；因此造成好赛擂平台品牌名誉损失，用户应做出相应赔偿，赔偿金额另行商议。
        </p>
        <p>
          2.&nbsp;
          如您在使用好赛擂平台服务过程中涉及上述行为中的一项或多项，则需要对自己的行为承担法律责任。承担法律责任的形式包括但不限于：对受到侵害者进行赔偿，以及在好赛擂平台运营公司首先承担了因用户行为导致的行政处罚或侵权损害赔偿责任后，用户应给予好赛擂平台运营公司等额的赔偿。此外，根据具体违法违规情形，好赛擂有权作出独立判断，立即暂停或终止对您提供部分或全部服务，包括锁定、注销、删除帐号等措施。同时，您同意，如因您的行为造成他人经济损失的，好赛擂平台可出于公共利益保护、消费者保护、商业利益保护等原则，在合法合规的前提下，从您的账户（如有）中划扣相应款项，您同意并授权、委托好赛擂进行上述划扣操作。
        </p>
        <p>
          3.&nbsp;
          您知悉并理解，如果好赛擂平台发现您的上述违法违规行为，依据相关法律法规的规定，好赛擂平台有权或有义务立即停止相关服务，删除或屏蔽相关违规信息、服务评价，并视情况进行调查取证，保存有关记录，或向国家有关机关举报。同时，好赛擂平台有权自主删除、屏蔽含有该内容的任何数据信息。好赛擂平台将根据国家相关法律法规要求，对依法删除、屏蔽的数据信息予以记录、保存。
        </p>
      </div>

      <div class="block">
        <h2>六、知识产权</h2>
        <p>
          好赛擂平台有权在所有由平台提供的功能界面标注“好赛擂大赛系统提供技术支持”等相关版权信息。
        </p>
      </div>

      <div class="block">
        <h2>七、其他</h2>
        <p>
          1.&nbsp;
          因不可抗力或者其他意外事件，使得本协议的履行不可能、不必要或者无意义的，双方均不承担责任。本协议所称之不可抗力意指不能预见、不能避免并不能克服的客观情况，包括但不限于战争、台风、水灾、火灾、雷击或地震、罢工、暴动、法定疾病、黑客攻击、网络病毒、电信部门技术管制、政府行为或任何其它自然或人为造成的灾难等客观情况。
        </p>
        <p>
          2.&nbsp;
          本条款及其修订本的有效性、履行和与本条款及其修订本效力有关的所有事宜，将受中华人民共和国法律约束，任何争议仅适用中华人民共和国法律。
        </p>
        <p>
          3.&nbsp;
          因本条款所引起的用户与本公司的任何纠纷或争议，首先应友好协商解决，协商不成的，用户在此同意将纠纷或争议提交本公司住所地有管辖权的人民法院诉讼解决。
        </p>
        <p>
          4.&nbsp;
          用户正确提交注册程序所需的资料并确认本协议后，本协议在好赛擂平台与用户之间成立并生效。
        </p>
        <p>
          5.&nbsp;
          本协议生效前的注册用户只需要使用原用户名及密码登录好赛擂平台网站重新接受并确认本协议，即可继续使用好赛擂平台的服务。
        </p>
        <p>
          6.&nbsp;
          协议有效期：从用户同意本协议或使用好赛擂平台起至用户注销好赛擂平台服务止。
        </p>
        <p>
          7.&nbsp; 使用好赛擂平台即表示接受好赛擂平台服务协议及其所有附件。
        </p>
        <p>
          8.&nbsp; 本协议的最终解释权归好赛擂平台所有。
        </p>
      </div>

      <cb-copyright position="relative" bottom="0" />

      <a-back-top :visibility-height="640" />
    </div>
  </div>
</template>

<script>
export default {
  layout: 'empty'
}
</script>

<style lang="less" scoped>
.page-agreement {
  padding-top: 48px;

  > .content {
    width: 840px;
    margin: 0 auto;

    .abstract {
      margin-bottom: 32px;
    }

    .block {
      margin-bottom: 32px;
    }

    h1 {
      margin-bottom: 32px;
      font-weight: bold;
    }

    h2 {
      margin-bottom: 12px;
    }

    h3 {
      margin-top: 20px;
    }

    p {
      margin-bottom: 4px;
      line-height: 2;
    }

    .darker {
      color: @text-color-4;
      font-weight: 600;
    }

    .cb-copyright {
      margin-bottom: 32px;
    }
  }
}
</style>
